"""
Домашнее задание №1

Цикл for: Продажи товаров

* Дан список словарей с данными по колличеству проданных телефонов
    [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
    ]
* Посчитать и вывести суммарное количество продаж для каждого товара
* Посчитать и вывести среднее количество продаж для каждого товара
* Посчитать и вывести суммарное количество продаж всех товаров
* Посчитать и вывести среднее количество продаж всех товаров
"""

stock = [
    {'product': 'iPhone 12', 'items_sold': [
        363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186
        ]},
    {'product': 'Xiaomi Mi11', 'items_sold': [
        317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316
        ]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [
        343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247
        ]},
        ]


def main():
    total_sold = 0
    for phone in stock:
        sold = sum(phone['items_sold'])
        months = len(phone['items_sold'])
        avg_model_sold = round(sold / months, 1)
        total_sold += sold
        avg_sold = round(total_sold / months, 1)
        print(f'Общие продажи {phone["product"]} составили {sold}')
        print(
            f'Среднее количество продаж {phone["product"]} '
            f'составило {avg_model_sold}'
            )
    print(f'Общее количество проданных телефонов составило {total_sold}')
    print(f'Среднее количество проданных телефонов составило {avg_sold}')


if __name__ == "__main__":
    main()
